import pytest

from src import get_date, mask_account_card


@pytest.mark.parametrize(
    "some_data, expected",
    [
        ("Visa 1234567843218765", "Visa 1234 56** **** 8765"),
        ("Счёт 12345678432187651234", "Счёт **1234"),
        ("1234567843218765", "1234 56** **** 8765"),
        ("12345678432187651234", "**1234"),
        ("MasterCard 1234 5678 4321 8765", "MasterCard 1234 56** **** 8765"),
        (1234567843218765, "1234 56** **** 8765"),
        ("Счёт 1234", "Ошибка. Проверьте правильность введённых данных."),
        ("буквы 1234567812345678", "Ошибка. Проверьте правильность введённых данных."),
        ("12345678", "Ошибка. Проверьте правильность введённых данных."),
        ("карта", "Ошибка. Пожалуйста, введите номер карты или счёта."),
        ("", "Ошибка. Пожалуйста, введите номер карты или счёта."),
    ],
)
def test_mask_account_card(some_data: int | str, expected: str) -> None:
    assert mask_account_card(some_data) == expected


@pytest.mark.parametrize(
    "some_data, expected",
    [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),
        ("2024-03-11T02:26:18", "11.03.2024"),
        ("2024-03-11", "11.03.2024"),
        ("2024/03/11T02:26:18.671407", "Ошибка. Некорректный формат даты."),
        ("24-03-11", "Ошибка. Некорректный формат даты."),
        ("", "Ошибка. Некорректный формат даты."),
        ("sdfj-uhg-vbdlj-khfbv", "Ошибка. Некорректный формат даты."),
        ("2024-13-45", "Ошибка. Некорректный формат даты."),
    ],
)
def test_get_date(some_data: str, expected: str) -> None:
    assert get_date(some_data) == expected
